"""
    Дана сторона квадрата.
    Посчитать и вывести периметр и площадь.
"""

a = int(input('Enter a: '))

perimetre = a * 4
area = a ** 2

print("Perimetre equals: ", perimetre)
print("Area equals: ", area)
